---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.GetEnumerator
source: html/09fb013c-f061-77b9-65a7-aa192af6823e.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.